joeycastillo/Sensor-Watch/Sensor Watch Starter Project/include/pio/saml22n16a.h
#define PIN_PB05B_ADC_AIN13               37L  /**< \brief ADC signal: AIN13 on PB05 mux B */
#define MUX_PB05B_ADC_AIN13                1L
#define PINMUX_PB05B_ADC_AIN13     ((PIN_PB05B_ADC_AIN13 << 16) | MUX_PB05B_ADC_AIN13)
#define PORT_PB05B_ADC_AIN13       (1ul <<  5)
#define PIN_PB06B_ADC_AIN14               38L  /**< \brief ADC signal: AIN14 on PB06 mux B */
#define MUX_PB06B_ADC_AIN14                1L
#define PINMUX_PB06B_ADC_AIN14     ((PIN_PB06B_ADC_AIN14 << 16) | MUX_PB06B_ADC_AIN14)
#define PORT_PB06B_ADC_AIN14       (1ul <<  6)
#define PIN_PB07B_ADC_AIN15               39L  /**< \brief ADC signal: AIN15 on PB07 mux B */
#define MUX_PB07B_ADC_AIN15                1L
#define PINMUX_PB07B_ADC_AIN15     ((PIN_PB07B_ADC_AIN15 << 16) | MUX_PB07B_ADC_AIN15)
#define PORT_PB07B_ADC_AIN15       (1ul <<  7)
#define PIN_PC00B_ADC_AIN16               64L  /**< \brief ADC signal: AIN16 on PC00 mux B */
#define MUX_PC00B_ADC_AIN16                1L
#define PINMUX_PC00B_ADC_AIN16     ((PIN_PC00B_ADC_AIN16 << 16) | MUX_PC00B_ADC_AIN16)
#define PORT_PC00B_ADC_AIN16       (1ul <<  0)
#define PIN_PC01B_ADC_AIN17               65L  /**< \brief ADC signal: AIN17 on PC01 mux B */
#define MUX_PC01B_ADC_AIN17                1L
#define PINMUX_PC01B_ADC_AIN17     ((PIN_PC01B_ADC_AIN17 << 16) | MUX_PC01B_ADC_AIN17)
#define PORT_PC01B_ADC_AIN17       (1ul <<  1)
#define PIN_PC02B_ADC_AIN18               66L  /**< \brief ADC signal: AIN18 on PC02 mux B */
#define MUX_PC02B_ADC_AIN18                1L
#define PINMUX_PC02B_ADC_AIN18     ((PIN_PC02B_ADC_AIN18 << 16) | MUX_PC02B_ADC_AIN18)
#define PORT_PC02B_ADC_AIN18       (1ul <<  2)
#define PIN_PC03B_ADC_AIN19               67L  /**< \brief ADC signal: AIN19 on PC03 mux B */
#define MUX_PC03B_ADC_AIN19                1L
#define PINMUX_PC03B_ADC_AIN19     ((PIN_PC03B_ADC_AIN19 << 16) | MUX_PC03B_ADC_AIN19)
#define PORT_PC03B_ADC_AIN19       (1ul <<  3)
#define PIN_PA03B_ADC_VREFA                3L  /**< \brief ADC signal: VREFA on PA03 mux B */
#define MUX_PA03B_ADC_VREFA                1L
#define PINMUX_PA03B_ADC_VREFA     ((PIN_PA03B_ADC_VREFA << 16) | MUX_PA03B_ADC_VREFA)
#define PORT_PA03B_ADC_VREFA       (1ul <<  3)
#define PIN_PA02B_ADC_VREFB                2L  /**< \brief ADC signal: VREFB on PA02 mux B */
#define MUX_PA02B_ADC_VREFB                1L
#define PINMUX_PA02B_ADC_VREFB     ((PIN_PA02B_ADC_VREFB << 16) | MUX_PA02B_ADC_VREFB)
#define PORT_PA02B_ADC_VREFB       (1ul <<  2)
/* ========== PORT definition for AC peripheral ========== */
#define PIN_PA02B_AC_AIN0                  2L  /**< \brief AC signal: AIN0 on PA02 mux B */
#define MUX_PA02B_AC_AIN0                  1L
#define PINMUX_PA02B_AC_AIN0       ((PIN_PA02B_AC_AIN0 << 16) | MUX_PA02B_AC_AIN0)
#define PORT_PA02B_AC_AIN0         (1ul <<  2)
#define PIN_PA03B_AC_AIN1                  3L  /**< \brief AC signal: AIN1 on PA03 mux B */
#define MUX_PA03B_AC_AIN1                  1L
#define PINMUX_PA03B_AC_AIN1       ((PIN_PA03B_AC_AIN1 << 16) | MUX_PA03B_AC_AIN1)
#define PORT_PA03B_AC_AIN1         (1ul <<  3)
#define PIN_PB04B_AC_AIN2                 36L  /**< \brief AC signal: AIN2 on PB04 mux B */
#define MUX_PB04B_AC_AIN2                  1L
#define PINMUX_PB04B_AC_AIN2       ((PIN_PB04B_AC_AIN2 << 16) | MUX_PB04B_AC_AIN2)
#define PORT_PB04B_AC_AIN2         (1ul <<  4)
#define PIN_PB05B_AC_AIN3                 37L  /**< \brief AC signal: AIN3 on PB05 mux B */
#define MUX_PB05B_AC_AIN3                  1L
#define PINMUX_PB05B_AC_AIN3       ((PIN_PB05B_AC_AIN3 << 16) | MUX_PB05B_AC_AIN3)
#define PORT_PB05B_AC_AIN3         (1ul <<  5)
#define PIN_PA12H_AC_CMP0                 12L  /**< \brief AC signal: CMP0 on PA12 mux H */
#define MUX_PA12H_AC_CMP0                  7L
#define PINMUX_PA12H_AC_CMP0       ((PIN_PA12H_AC_CMP0 << 16) | MUX_PA12H_AC_CMP0)
#define PORT_PA12H_AC_CMP0         (1ul << 12)
#define PIN_PA18H_AC_CMP0                 18L  /**< \brief AC signal: CMP0 on PA18 mux H */
#define MUX_PA18H_AC_CMP0                  7L
#define PINMUX_PA18H_AC_CMP0       ((PIN_PA18H_AC_CMP0 << 16) | MUX_PA18H_AC_CMP0)
#define PORT_PA18H_AC_CMP0         (1ul << 18)
#define PIN_PB24H_AC_CMP0                 56L  /**< \brief AC signal: CMP0 on PB24 mux H */
#define MUX_PB24H_AC_CMP0                  7L
#define PINMUX_PB24H_AC_CMP0       ((PIN_PB24H_AC_CMP0 << 16) | MUX_PB24H_AC_CMP0)
#define PORT_PB24H_AC_CMP0         (1ul << 24)
#define PIN_PA13H_AC_CMP1                 13L  /**< \brief AC signal: CMP1 on PA13 mux H */
#define MUX_PA13H_AC_CMP1                  7L
#define PINMUX_PA13H_AC_CMP1       ((PIN_PA13H_AC_CMP1 << 16) | MUX_PA13H_AC_CMP1)
#define PORT_PA13H_AC_CMP1         (1ul << 13)
#define PIN_PA19H_AC_CMP1                 19L  /**< \brief AC signal: CMP1 on PA19 mux H */
#define MUX_PA19H_AC_CMP1                  7L
#define PINMUX_PA19H_AC_CMP1       ((PIN_PA19H_AC_CMP1 << 16) | MUX_PA19H_AC_CMP1)
#define PORT_PA19H_AC_CMP1         (1ul << 19)
#define PIN_PB25H_AC_CMP1                 57L  /**< \brief AC signal: CMP1 on PB25 mux H */
#define MUX_PB25H_AC_CMP1                  7L
#define PINMUX_PB25H_AC_CMP1       ((PIN_PB25H_AC_CMP1 << 16) | MUX_PB25H_AC_CMP1)
#define PORT_PB25H_AC_CMP1         (1ul << 25)
/* ========== PORT definition for SLCD peripheral ========== */
#define PIN_PB06B_SLCD_LP0                38L  /**< \brief SLCD signal: LP0 on PB06 mux B */
#define MUX_PB06B_SLCD_LP0                 1L
#define PINMUX_PB06B_SLCD_LP0      ((PIN_PB06B_SLCD_LP0 << 16) | MUX_PB06B_SLCD_LP0)
#define PORT_PB06B_SLCD_LP0        (1ul <<  6)
#define PIN_PB07B_SLCD_LP1                39L  /**< \brief SLCD signal: LP1 on PB07 mux B */
#define MUX_PB07B_SLCD_LP1                 1L
#define PINMUX_PB07B_SLCD_LP1      ((PIN_PB07B_SLCD_LP1 << 16) | MUX_PB07B_SLCD_LP1)
#define PORT_PB07B_SLCD_LP1        (1ul <<  7)
#define PIN_PB08B_SLCD_LP2                40L  /**< \brief SLCD signal: LP2 on PB08 mux B */
#define MUX_PB08B_SLCD_LP2                 1L
#define PINMUX_PB08B_SLCD_LP2      ((PIN_PB08B_SLCD_LP2 << 16) | MUX_PB08B_SLCD_LP2)
#define PORT_PB08B_SLCD_LP2        (1ul <<  8)
#define PIN_PB09B_SLCD_LP3                41L  /**< \brief SLCD signal: LP3 on PB09 mux B */
#define MUX_PB09B_SLCD_LP3                 1L
#define PINMUX_PB09B_SLCD_LP3      ((PIN_PB09B_SLCD_LP3 << 16) | MUX_PB09B_SLCD_LP3)
#define PORT_PB09B_SLCD_LP3        (1ul <<  9)
#define PIN_PA04B_SLCD_LP4                 4L  /**< \brief SLCD signal: LP4 on PA04 mux B */
#define MUX_PA04B_SLCD_LP4                 1L
#define PINMUX_PA04B_SLCD_LP4      ((PIN_PA04B_SLCD_LP4 << 16) | MUX_PA04B_SLCD_LP4)
#define PORT_PA04B_SLCD_LP4        (1ul <<  4)
#define PIN_PA05B_SLCD_LP5                 5L  /**< \brief SLCD signal: LP5 on PA05 mux B */
#define MUX_PA05B_SLCD_LP5                 1L
#define PINMUX_PA05B_SLCD_LP5      ((PIN_PA05B_SLCD_LP5 << 16) | MUX_PA05B_SLCD_LP5)
#define PORT_PA05B_SLCD_LP5        (1ul <<  5)
#define PIN_PA06B_SLCD_LP6                 6L  /**< \brief SLCD signal: LP6 on PA06 mux B */
#define MUX_PA06B_SLCD_LP6                 1L
#define PINMUX_PA06B_SLCD_LP6      ((PIN_PA06B_SLCD_LP6 << 16) | MUX_PA06B_SLCD_LP6)
#define PORT_PA06B_SLCD_LP6        (1ul <<  6)
#define PIN_PA07B_SLCD_LP7                 7L  /**< \brief SLCD signal: LP7 on PA07 mux B */
#define MUX_PA07B_SLCD_LP7                 1L
#define PINMUX_PA07B_SLCD_LP7      ((PIN_PA07B_SLCD_LP7 << 16) | MUX_PA07B_SLCD_LP7)
#define PORT_PA07B_SLCD_LP7        (1ul <<  7)
#define PIN_PC05B_SLCD_LP8                69L  /**< \brief SLCD signal: LP8 on PC05 mux B */
#define MUX_PC05B_SLCD_LP8                 1L
#define PINMUX_PC05B_SLCD_LP8      ((PIN_PC05B_SLCD_LP8 << 16) | MUX_PC05B_SLCD_LP8)
#define PORT_PC05B_SLCD_LP8        (1ul <<  5)
#define PIN_PC06B_SLCD_LP9                70L  /**< \brief SLCD signal: LP9 on PC06 mux B */
#define MUX_PC06B_SLCD_LP9                 1L
#define PINMUX_PC06B_SLCD_LP9      ((PIN_PC06B_SLCD_LP9 << 16) | MUX_PC06B_SLCD_LP9)
#define PORT_PC06B_SLCD_LP9        (1ul <<  6)
#define PIN_PC07B_SLCD_LP10               71L  /**< \brief SLCD signal: LP10 on PC07 mux B */
#define MUX_PC07B_SLCD_LP10                1L
#define PINMUX_PC07B_SLCD_LP10     ((PIN_PC07B_SLCD_LP10 << 16) | MUX_PC07B_SLCD_LP10)
#define PORT_PC07B_SLCD_LP10       (1ul <<  7)
#define PIN_PA08B_SLCD_LP11                8L  /**< \brief SLCD signal: LP11 on PA08 mux B */
#define MUX_PA08B_SLCD_LP11                1L
#define PINMUX_PA08B_SLCD_LP11     ((PIN_PA08B_SLCD_LP11 << 16) | MUX_PA08B_SLCD_LP11)
#define PORT_PA08B_SLCD_LP11       (1ul <<  8)
#define PIN_PA09B_SLCD_LP12                9L  /**< \brief SLCD signal: LP12 on PA09 mux B */
#define MUX_PA09B_SLCD_LP12                1L
#define PINMUX_PA09B_SLCD_LP12     ((PIN_PA09B_SLCD_LP12 << 16) | MUX_PA09B_SLCD_LP12)
#define PORT_PA09B_SLCD_LP12       (1ul <<  9)
#define PIN_PA10B_SLCD_LP13               10L  /**< \brief SLCD signal: LP13 on PA10 mux B */
#define MUX_PA10B_SLCD_LP13                1L
#define PINMUX_PA10B_SLCD_LP13     ((PIN_PA10B_SLCD_LP13 << 16) | MUX_PA10B_SLCD_LP13)
#define PORT_PA10B_SLCD_LP13       (1ul << 10)
#define PIN_PA11B_SLCD_LP14               11L  /**< \brief SLCD signal: LP14 on PA11 mux B */
#define MUX_PA11B_SLCD_LP14                1L
#define PINMUX_PA11B_SLCD_LP14     ((PIN_PA11B_SLCD_LP14 << 16) | MUX_PA11B_SLCD_LP14)
#define PORT_PA11B_SLCD_LP14       (1ul << 11)
#define PIN_PC08B_SLCD_LP15               72L  /**< \brief SLCD signal: LP15 on PC08 mux B */
#define MUX_PC08B_SLCD_LP15                1L
#define PINMUX_PC08B_SLCD_LP15     ((PIN_PC08B_SLCD_LP15 << 16) | MUX_PC08B_SLCD_LP15)
#define PORT_PC08B_SLCD_LP15       (1ul <<  8)
#define PIN_PC09B_SLCD_LP16               73L  /**< \brief SLCD signal: LP16 on PC09 mux B */
#define MUX_PC09B_SLCD_LP16                1L
#define PINMUX_PC09B_SLCD_LP16     ((PIN_PC09B_SLCD_LP16 << 16) | MUX_PC09B_SLCD_LP16)
#define PORT_PC09B_SLCD_LP16       (1ul <<  9)
#define PIN_PC10B_SLCD_LP17               74L  /**< \brief SLCD signal: LP17 on PC10 mux B */
#define MUX_PC10B_SLCD_LP17                1L
#define PINMUX_PC10B_SLCD_LP17     ((PIN_PC10B_SLCD_LP17 << 16) | MUX_PC10B_SLCD_LP17)
#define PORT_PC10B_SLCD_LP17       (1ul << 10)
#define PIN_PC11B_SLCD_LP18               75L  /**< \brief SLCD signal: LP18 on PC11 mux B */
#define MUX_PC11B_SLCD_LP18                1L
#define PINMUX_PC11B_SLCD_LP18     ((PIN_PC11B_SLCD_LP18 << 16) | MUX_PC11B_SLCD_LP18)
#define PORT_PC11B_SLCD_LP18       (1ul << 11)
#define PIN_PC12B_SLCD_LP19               76L  /**< \brief SLCD signal: LP19 on PC12 mux B */
#define MUX_PC12B_SLCD_LP19                1L
#define PINMUX_PC12B_SLCD_LP19     ((PIN_PC12B_SLCD_LP19 << 16) | MUX_PC12B_SLCD_LP19)
#define PORT_PC12B_SLCD_LP19       (1ul << 12)
#define PIN_PC13B_SLCD_LP20               77L  /**< \brief SLCD signal: LP20 on PC13 mux B */
#define MUX_PC13B_SLCD_LP20                1L
#define PINMUX_PC13B_SLCD_LP20     ((PIN_PC13B_SLCD_LP20 << 16) | MUX_PC13B_SLCD_LP20)
#define PORT_PC13B_SLCD_LP20       (1ul << 13)
#define PIN_PB11B_SLCD_LP21               43L  /**< \brief SLCD signal: LP21 on PB11 mux B */
#define MUX_PB11B_SLCD_LP21                1L
#define PINMUX_PB11B_SLCD_LP21     ((PIN_PB11B_SLCD_LP21 << 16) | MUX_PB11B_SLCD_LP21)
#define PORT_PB11B_SLCD_LP21       (1ul << 11)
#define PIN_PB12B_SLCD_LP22               44L  /**< \brief SLCD signal: LP22 on PB12 mux B */
#define MUX_PB12B_SLCD_LP22                1L
#define PINMUX_PB12B_SLCD_LP22     ((PIN_PB12B_SLCD_LP22 << 16) | MUX_PB12B_SLCD_LP22)
#define PORT_PB12B_SLCD_LP22       (1ul << 12)
#define PIN_PB13B_SLCD_LP23               45L  /**< \brief SLCD signal: LP23 on PB13 mux B */
#define MUX_PB13B_SLCD_LP23                1L
#define PINMUX_PB13B_SLCD_LP23     ((PIN_PB13B_SLCD_LP23 << 16) | MUX_PB13B_SLCD_LP23)
#define PORT_PB13B_SLCD_LP23       (1ul << 13)
#define PIN_PB14B_SLCD_LP24               46L  /**< \brief SLCD signal: LP24 on PB14 mux B */
#define MUX_PB14B_SLCD_LP24                1L
#define PINMUX_PB14B_SLCD_LP24     ((PIN_PB14B_SLCD_LP24 << 16) | MUX_PB14B_SLCD_LP24)
#define PORT_PB14B_SLCD_LP24       (1ul << 14)
#define PIN_PB15B_SLCD_LP25               47L  /**< \brief SLCD signal: LP25 on PB15 mux B */
#define MUX_PB15B_SLCD_LP25                1L
#define PINMUX_PB15B_SLCD_LP25     ((PIN_PB15B_SLCD_LP25 << 16) | MUX_PB15B_SLCD_LP25)
#define PORT_PB15B_SLCD_LP25       (1ul << 15)
#define PIN_PC14B_SLCD_LP26               78L  /**< \brief SLCD signal: LP26 on PC14 mux B */
#define MUX_PC14B_SLCD_LP26                1L
#define PINMUX_PC14B_SLCD_LP26     ((PIN_PC14B_SLCD_LP26 << 16) | MUX_PC14B_SLCD_LP26)
#define PORT_PC14B_SLCD_LP26       (1ul << 14)
#define PIN_PC15B_SLCD_LP27               79L  /**< \brief SLCD signal: LP27 on PC15 mux B */
#define MUX_PC15B_SLCD_LP27                1L
#define PINMUX_PC15B_SLCD_LP27     ((PIN_PC15B_SLCD_LP27 << 16) | MUX_PC15B_SLCD_LP27)
#define PORT_PC15B_SLCD_LP27       (1ul << 15)
#define PIN_PA12B_SLCD_LP28               12L  /**< \brief SLCD signal: LP28 on PA12 mux B */
#define MUX_PA12B_SLCD_LP28                1L
#define PINMUX_PA12B_SLCD_LP28     ((PIN_PA12B_SLCD_LP28 << 16) | MUX_PA12B_SLCD_LP28)
#define PORT_PA12B_SLCD_LP28       (1ul << 12)
#define PIN_PA13B_SLCD_LP29               13L  /**< \brief SLCD signal: LP29 on PA13 mux B */
#define MUX_PA13B_SLCD_LP29                1L
#define PINMUX_PA13B_SLCD_LP29     ((PIN_PA13B_SLCD_LP29 << 16) | MUX_PA13B_SLCD_LP29)
#define PORT_PA13B_SLCD_LP29       (1ul << 13)
#define PIN_PA14B_SLCD_LP30               14L  /**< \brief SLCD signal: LP30 on PA14 mux B */
#define MUX_PA14B_SLCD_LP30                1L
#define PINMUX_PA14B_SLCD_LP30     ((PIN_PA14B_SLCD_LP30 << 16) | MUX_PA14B_SLCD_LP30)
#define PORT_PA14B_SLCD_LP30       (1ul << 14)
#define PIN_PA15B_SLCD_LP31               15L  /**< \brief SLCD signal: LP31 on PA15 mux B */
#define MUX_PA15B_SLCD_LP31                1L
#define PINMUX_PA15B_SLCD_LP31     ((PIN_PA15B_SLCD_LP31 << 16) | MUX_PA15B_SLCD_LP31)
#define PORT_PA15B_SLCD_LP31       (1ul << 15)
#define PIN_PA16B_SLCD_LP32               16L  /**< \brief SLCD signal: LP32 on PA16 mux B */
#define MUX_PA16B_SLCD_LP32                1L
#define PINMUX_PA16B_SLCD_LP32     ((PIN_PA16B_SLCD_LP32 << 16) | MUX_PA16B_SLCD_LP32)
#define PORT_PA16B_SLCD_LP32       (1ul << 16)
#define PIN_PA17B_SLCD_LP33               17L  /**< \brief SLCD signal: LP33 on PA17 mux B */
#define MUX_PA17B_SLCD_LP33                1L
#define PINMUX_PA17B_SLCD_LP33     ((PIN_PA17B_SLCD_LP33 << 16) | MUX_PA17B_SLCD_LP33)
#define PORT_PA17B_SLCD_LP33       (1ul << 17)
#define PIN_PA18B_SLCD_LP34               18L  /**< \brief SLCD signal: LP34 on PA18 mux B */
#define MUX_PA18B_SLCD_LP34                1L
#define PINMUX_PA18B_SLCD_LP34     ((PIN_PA18B_SLCD_LP34 << 16) | MUX_PA18B_SLCD_LP34)
#define PORT_PA18B_SLCD_LP34       (1ul << 18)
#define PIN_PA19B_SLCD_LP35               19L  /**< \brief SLCD signal: LP35 on PA19 mux B */
#define MUX_PA19B_SLCD_LP35                1L
#define PINMUX_PA19B_SLCD_LP35     ((PIN_PA19B_SLCD_LP35 << 16) | MUX_PA19B_SLCD_LP35)
#define PORT_PA19B_SLCD_LP35       (1ul << 19)
#define PIN_PC16B_SLCD_LP36               80L  /**< \brief SLCD signal: LP36 on PC16 mux B */
#define MUX_PC16B_SLCD_LP36                1L
#define PINMUX_PC16B_SLCD_LP36     ((PIN_PC16B_SLCD_LP36 << 16) | MUX_PC16B_SLCD_LP36)
#define PORT_PC16B_SLCD_LP36       (1ul << 16)
#define PIN_PC17B_SLCD_LP37               81L  /**< \brief SLCD signal: LP37 on PC17 mux B */
#define MUX_PC17B_SLCD_LP37                1L
#define PINMUX_PC17B_SLCD_LP37     ((PIN_PC17B_SLCD_LP37 << 16) | MUX_PC17B_SLCD_LP37)
#define PORT_PC17B_SLCD_LP37       (1ul << 17)
#define PIN_PC18B_SLCD_LP38               82L  /**< \brief SLCD signal: LP38 on PC18 mux B */
#define MUX_PC18B_SLCD_LP38                1L
#define PINMUX_PC18B_SLCD_LP38     ((PIN_PC18B_SLCD_LP38 << 16) | MUX_PC18B_SLCD_LP38)
#define PORT_PC18B_SLCD_LP38       (1ul << 18)
#define PIN_PC19B_SLCD_LP39               83L  /**< \brief SLCD signal: LP39 on PC19 mux B */
#define MUX_PC19B_SLCD_LP39                1L
#define PINMUX_PC19B_SLCD_LP39     ((PIN_PC19B_SLCD_LP39 << 16) | MUX_PC19B_SLCD_LP39)
#define PORT_PC19B_SLCD_LP39       (1ul << 19)
#define PIN_PC20B_SLCD_LP40               84L  /**< \brief SLCD signal: LP40 on PC20 mux B */
#define MUX_PC20B_SLCD_LP40                1L
#define PINMUX_PC20B_SLCD_LP40     ((PIN_PC20B_SLCD_LP40 << 16) | MUX_PC20B_SLCD_LP40)
#define PORT_PC20B_SLCD_LP40       (1ul << 20)
#define PIN_PC21B_SLCD_LP41               85L  /**< \brief SLCD signal: LP41 on PC21 mux B */
#define MUX_PC21B_SLCD_LP41                1L
#define PINMUX_PC21B_SLCD_LP41     ((PIN_PC21B_SLCD_LP41 << 16) | MUX_PC21B_SLCD_LP41)
#define PORT_PC21B_SLCD_LP41       (1ul << 21)
#define PIN_PB16B_SLCD_LP42               48L  /**< \brief SLCD signal: LP42 on PB16 mux B */
#define MUX_PB16B_SLCD_LP42                1L
#define PINMUX_PB16B_SLCD_LP42     ((PIN_PB16B_SLCD_LP42 << 16) | MUX_PB16B_SLCD_LP42)
#define PORT_PB16B_SLCD_LP42       (1ul << 16)
#define PIN_PB17B_SLCD_LP43               49L  /**< \brief SLCD signal: LP43 on PB17 mux B */
#define MUX_PB17B_SLCD_LP43                1L
#define PINMUX_PB17B_SLCD_LP43     ((PIN_PB17B_SLCD_LP43 << 16) | MUX_PB17B_SLCD_LP43)
#define PORT_PB17B_SLCD_LP43       (1ul << 17)
#define PIN_PB18B_SLCD_LP44               50L  /**< \brief SLCD signal: LP44 on PB18 mux B */
#define MUX_PB18B_SLCD_LP44                1L
#define PINMUX_PB18B_SLCD_LP44     ((PIN_PB18B_SLCD_LP44 << 16) | MUX_PB18B_SLCD_LP44)
#define PORT_PB18B_SLCD_LP44       (1ul << 18)
#define PIN_PB19B_SLCD_LP45               51L  /**< \brief SLCD signal: LP45 on PB19 mux B */
#define MUX_PB19B_SLCD_LP45                1L
#define PINMUX_PB19B_SLCD_LP45     ((PIN_PB19B_SLCD_LP45 << 16) | MUX_PB19B_SLCD_LP45)
#define PORT_PB19B_SLCD_LP45       (1ul << 19)
#define PIN_PB20B_SLCD_LP46               52L  /**< \brief SLCD signal: LP46 on PB20 mux B */
#define MUX_PB20B_SLCD_LP46                1L
#define PINMUX_PB20B_SLCD_LP46     ((PIN_PB20B_SLCD_LP46 << 16) | MUX_PB20B_SLCD_LP46)
#define PORT_PB20B_SLCD_LP46       (1ul << 20)
#define PIN_PB21B_SLCD_LP47               53L  /**< \brief SLCD signal: LP47 on PB21 mux B */
#define MUX_PB21B_SLCD_LP47                1L
#define PINMUX_PB21B_SLCD_LP47     ((PIN_PB21B_SLCD_LP47 << 16) | MUX_PB21B_SLCD_LP47)
#define PORT_PB21B_SLCD_LP47       (1ul << 21)
#define PIN_PA20B_SLCD_LP48               20L  /**< \brief SLCD signal: LP48 on PA20 mux B */
#define MUX_PA20B_SLCD_LP48                1L
#define PINMUX_PA20B_SLCD_LP48     ((PIN_PA20B_SLCD_LP48 << 16) | MUX_PA20B_SLCD_LP48)
#define PORT_PA20B_SLCD_LP48       (1ul << 20)
#define PIN_PA21B_SLCD_LP49               21L  /**< \brief SLCD signal: LP49 on PA21 mux B */
#define MUX_PA21B_SLCD_LP49                1L
#define PINMUX_PA21B_SLCD_LP49     ((PIN_PA21B_SLCD_LP49 << 16) | MUX_PA21B_SLCD_LP49)
#define PORT_PA21B_SLCD_LP49       (1ul << 21)
#define PIN_PA22B_SLCD_LP50               22L  /**< \brief SLCD signal: LP50 on PA22 mux B */
#define MUX_PA22B_SLCD_LP50                1L
#define PINMUX_PA22B_SLCD_LP50     ((PIN_PA22B_SLCD_LP50 << 16) | MUX_PA22B_SLCD_LP50)
#define PORT_PA22B_SLCD_LP50       (1ul << 22)
#define PIN_PA23B_SLCD_LP51               23L  /**< \brief SLCD signal: LP51 on PA23 mux B */
#define MUX_PA23B_SLCD_LP51                1L
#define PINMUX_PA23B_SLCD_LP51     ((PIN_PA23B_SLCD_LP51 << 16) | MUX_PA23B_SLCD_LP51)
#define PORT_PA23B_SLCD_LP51       (1ul << 23)
/* ========== PORT definition for CCL peripheral ========== */
#define PIN_PA04I_CCL_IN0                  4L  /**< \brief CCL signal: IN0 on PA04 mux I */
#define MUX_PA04I_CCL_IN0                  8L
#define PINMUX_PA04I_CCL_IN0       ((PIN_PA04I_CCL_IN0 << 16) | MUX_PA04I_CCL_IN0)
#define PORT_PA04I_CCL_IN0         (1ul <<  4)
#define PIN_PA16I_CCL_IN0                 16L  /**< \brief CCL signal: IN0 on PA16 mux I */
#define MUX_PA16I_CCL_IN0                  8L
#define PINMUX_PA16I_CCL_IN0       ((PIN_PA16I_CCL_IN0 << 16) | MUX_PA16I_CCL_IN0)
#define PORT_PA16I_CCL_IN0         (1ul << 16)
#define PIN_PB22I_CCL_IN0                 54L  /**< \brief CCL signal: IN0 on PB22 mux I */
#define MUX_PB22I_CCL_IN0                  8L
#define PINMUX_PB22I_CCL_IN0       ((PIN_PB22I_CCL_IN0 << 16) | MUX_PB22I_CCL_IN0)
#define PORT_PB22I_CCL_IN0         (1ul << 22)
#define PIN_PA05I_CCL_IN1                  5L  /**< \brief CCL signal: IN1 on PA05 mux I */
#define MUX_PA05I_CCL_IN1                  8L
#define PINMUX_PA05I_CCL_IN1       ((PIN_PA05I_CCL_IN1 << 16) | MUX_PA05I_CCL_IN1)
#define PORT_PA05I_CCL_IN1         (1ul <<  5)
#define PIN_PA17I_CCL_IN1                 17L  /**< \brief CCL signal: IN1 on PA17 mux I */
#define MUX_PA17I_CCL_IN1                  8L
#define PINMUX_PA17I_CCL_IN1       ((PIN_PA17I_CCL_IN1 << 16) | MUX_PA17I_CCL_IN1)
#define PORT_PA17I_CCL_IN1         (1ul << 17)
#define PIN_PB00I_CCL_IN1                 32L  /**< \brief CCL signal: IN1 on PB00 mux I */
#define MUX_PB00I_CCL_IN1                  8L
#define PINMUX_PB00I_CCL_IN1       ((PIN_PB00I_CCL_IN1 << 16) | MUX_PB00I_CCL_IN1)
#define PORT_PB00I_CCL_IN1         (1ul <<  0)
#define PIN_PA06I_CCL_IN2                  6L  /**< \brief CCL signal: IN2 on PA06 mux I */
#define MUX_PA06I_CCL_IN2                  8L
#define PINMUX_PA06I_CCL_IN2       ((PIN_PA06I_CCL_IN2 << 16) | MUX_PA06I_CCL_IN2)
#define PORT_PA06I_CCL_IN2         (1ul <<  6)
#define PIN_PA18I_CCL_IN2                 18L  /**< \brief CCL signal: IN2 on PA18 mux I */
#define MUX_PA18I_CCL_IN2                  8L
#define PINMUX_PA18I_CCL_IN2       ((PIN_PA18I_CCL_IN2 << 16) | MUX_PA18I_CCL_IN2)
#define PORT_PA18I_CCL_IN2         (1ul << 18)
#define PIN_PB01I_CCL_IN2                 33L  /**< \brief CCL signal: IN2 on PB01 mux I */
#define MUX_PB01I_CCL_IN2                  8L
#define PINMUX_PB01I_CCL_IN2       ((PIN_PB01I_CCL_IN2 << 16) | MUX_PB01I_CCL_IN2)
#define PORT_PB01I_CCL_IN2         (1ul <<  1)
#define PIN_PA08I_CCL_IN3                  8L  /**< \brief CCL signal: IN3 on PA08 mux I */
#define MUX_PA08I_CCL_IN3                  8L
#define PINMUX_PA08I_CCL_IN3       ((PIN_PA08I_CCL_IN3 << 16) | MUX_PA08I_CCL_IN3)
#define PORT_PA08I_CCL_IN3         (1ul <<  8)
#define PIN_PA30I_CCL_IN3                 30L  /**< \brief CCL signal: IN3 on PA30 mux I */
#define MUX_PA30I_CCL_IN3                  8L
#define PINMUX_PA30I_CCL_IN3       ((PIN_PA30I_CCL_IN3 << 16) | MUX_PA30I_CCL_IN3)
#define PORT_PA30I_CCL_IN3         (1ul << 30)
#define PIN_PA09I_CCL_IN4                  9L  /**< \brief CCL signal: IN4 on PA09 mux I */
#define MUX_PA09I_CCL_IN4                  8L
#define PINMUX_PA09I_CCL_IN4       ((PIN_PA09I_CCL_IN4 << 16) | MUX_PA09I_CCL_IN4)
#define PORT_PA09I_CCL_IN4         (1ul <<  9)
#define PIN_PC27I_CCL_IN4                 91L  /**< \brief CCL signal: IN4 on PC27 mux I */
#define MUX_PC27I_CCL_IN4                  8L
#define PINMUX_PC27I_CCL_IN4       ((PIN_PC27I_CCL_IN4 << 16) | MUX_PC27I_CCL_IN4)
#define PORT_PC27I_CCL_IN4         (1ul << 27)
#define PIN_PA10I_CCL_IN5                 10L  /**< \brief CCL signal: IN5 on PA10 mux I */
#define MUX_PA10I_CCL_IN5                  8L
#define PINMUX_PA10I_CCL_IN5       ((PIN_PA10I_CCL_IN5 << 16) | MUX_PA10I_CCL_IN5)
#define PORT_PA10I_CCL_IN5         (1ul << 10)
#define PIN_PC28I_CCL_IN5                 92L  /**< \brief CCL signal: IN5 on PC28 mux I */
#define MUX_PC28I_CCL_IN5                  8L
#define PINMUX_PC28I_CCL_IN5       ((PIN_PC28I_CCL_IN5 << 16) | MUX_PC28I_CCL_IN5)
#define PORT_PC28I_CCL_IN5         (1ul << 28)
